{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 128, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "filters": 128, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_3", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_4", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "filters": 256, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_5", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_6", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_7", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_8", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 128, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_9", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_10", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_11", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_12", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "activity_regularizer": null, "padding": "same", "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "filters": 2, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_13", "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "sigmoid"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "data_format": "channels_last", "trainable": true, "size": [2, 2]}}]}